
#Область ПрограммныйИнтерфейс

// Вызов этой процедуры необходимо разместить в модуле сеанса в процедуре УстановкаПараметровСеанса
// согласно документации.
//
// Параметры:
//  ИменаПараметровСеанса - Массив
//                        - Неопределено - имена параметров сеанса для инициализации.
//                                         Массив устанавливаемых идентификаторов параметров сеанса,
//                                         которые нужно инициализировать, если обработчик вызывается
//                                         перед использованием неинициализированных параметров сеанса.
//                                         Неопределено, если обработчик события вызывается системой при начале сеанса.
//
// Возвращаемое значение:
//  Массив - имена параметров сеанса, значения которых были успешно установлены.
//
Функция УстановкаПараметровСеанса(ИменаПараметровСеанса) Экспорт
	
	// Параметры сеанса, инициализация которых требует обращения к одним и тем же данным
	// следует инициализировать сразу группой. Для того, чтобы избежать их повторной инициализации,
	// имена уже установленных параметров сеанса сохраняются в массиве УстановленныеПараметры.
	УстановленныеПараметры = Новый Массив;
	
	ПользователиСлужебный.УстановкаПараметровСеанса("ТекущийПользователь", УстановленныеПараметры);
	ПользователиСлужебный.УстановкаПараметровСеанса("АвторизованныйПользователь", УстановленныеПараметры);
	
	//Если ИменаПараметровСеанса <> Неопределено
	//   И ИменаПараметровСеанса.Найти("ПараметрыКлиентаНаСервере") <> Неопределено Тогда
	//	
	//	ПараметрыСеанса.ПараметрыКлиентаНаСервере = Новый ФиксированноеСоответствие(Новый Соответствие);
	//	УстановленныеПараметры.Добавить("ПараметрыКлиентаНаСервере");
	//	Если ИменаПараметровСеанса.Количество() = 1 Тогда
	//		Возврат УстановленныеПараметры;
	//	КонецЕсли;
	//КонецЕсли;
			
	Возврат УстановленныеПараметры;
	
КонецФункции

#КонецОбласти
