#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ОбъектКопирования.Статус = Перечисления.СтатусыЗаявокСотрудников.Черновик;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение 
		И  ЭтотОбъект.Статус = Перечисления.СтатусыЗаявокСотрудников.Черновик Тогда
		
		ЭтотОбъект.Статус = Перечисления.СтатусыЗаявокСотрудников.НаСогласовании;	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли